namespace Forto4kiParser.Helpers
{
    public static class WarehouseHelper
    {
        public static string GetWrhIdByName(string name) => name switch
        {
            "МСК" => "1",
            "ЯМК" => "232",
            "ДВД" => "1222",
            "СК 2" => "9",
            "СК 3" => "3",
            "СК 4" => "4",
            "ЯРПИШ3" => "1046",
            "ВРН" => "755",
            "КЗ ОП" => "154",
            "НН2" => "949",
            "СМР2" => "846",
            "СПБЦР" => "115",
            "ТЛТ2" => "766",
            "КР-И" => "46",
            "РНД" => "313",
            "УФА" => "57",
            "ЕКБ" => "22",
            "НВРС2" => "689",
            "ПТГ2" => "853",
            "ЧЛБ" => "43",
            "ПРМ" => "865",
            "ТМН" => "42",
            "НВСБ2" => "562",
            "СИМ2" => "1278",
            "КРЯР" => "1015",
        };
    }
}
